public class Java01 {
    //클래스란?
    // 객체를 만들어 내기위한 설계도 혹은 틀! (ex. 붕어빵 틀)
    // 연관되어 있는 변수와 메서드의 집합
    //자바에서 설계도 --> 클래스
    // 클래스는 객체를 생성하기 위한 필드와 메소드가 정의되어 있음

    //객체란?
    // 소프트웨어 세계에 구현할 대상
    // 클래스에 선언된 모양 그대로 생성될 실체
    // 객체를 실체화하면 '인스턴스'라 부른다.

    //객체 특징
    // 클래스로부터 객체를 만드는 과정을 인스턴스화라 한다.
    // 하나의 클래스로부터 여러 개의 인스턴스(객체) 생성 가능
    // 클래스로부터 만들어진 객체를 해당 클래스의 인스턴스(instance)라 한다.
    // ex) 자동차 객체는 자동차 클래스 인스턴스이다.

    //인스턴스 특징
    //인스턴스는 객체에 포함된다.
    //객체는 클래스의 인스턴스이다.
    //객체 간의 링크는 클래스 간의 연관 관계에 인스턴스다.
    //즉, 어떤 원본(추상적인 개념)으로부터 '생성된 복제본'을 의미미

}
